
## Plan Result

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3121183940)


<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.memo_board_tf_exec
  * aws_iam_role_policy_attachment.memo_board_tf_exec
* Update
  * aws_iam_policy.memo_board_cd1
  * aws_iam_policy.memo_board_tf1


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.memo_board_cd1 will be updated in-place
  ~ resource "aws_iam_policy" "memo_board_cd1" {
        id        = "arn:aws:iam::281036478087:policy/memo_board_cd1"
        name      = "memo_board_cd1"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "ecr:GetAuthorizationToken" -> [
                          + "ecs:RegisterTaskDefinition",
                          + "ecr:GetAuthorizationToken",
                        ]
                      ~ Sid      = "GetAuthorizationToken" -> "AllowForGeneralResources"
                        # (2 unchanged elements hidden)
                    },
                    {
                        Action   = [
                            "ecr:UploadLayerPart",
                            "ecr:PutImage",
                            "ecr:InitiateLayerUpload",
                            "ecr:GetDownloadUrlForLayer",
                            "ecr:CompleteLayerUpload",
                            "ecr:BatchGetImage",
                            "ecr:BatchCheckLayerAvailability",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:ap-northeast-1:281036478087:repository/memo-board-rs"
                        Sid      = "AllowPushPull"
                    },
                  + {
                      + Action   = [
                          + "ecs:UpdateService",
                          + "ecs:DescribeServices",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowForECS"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowPassRole"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.memo_board_tf1 will be updated in-place
  ~ resource "aws_iam_policy" "memo_board_tf1" {
        id        = "arn:aws:iam::281036478087:policy/memo_board_tf1"
        name      = "memo_board_tf1"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::hiyoko3m-tfstate/memo_board"
                        Sid      = ""
                    },
                  ~ {
                      ~ Action   = [
                          - "ecs:*",
                          - "ecr:*",
                          + "iam:SimulatePrincipalPolicy",
                          + "iam:SimulateCustomPolicy",
                          + "iam:List*",
                          + "iam:Get*",
                          + "iam:GenerateServiceLastAccessedDetails",
                          + "iam:GenerateCredentialReport",
                        ]
                      ~ Sid      = "" -> "IAMReadOnlyAccess"
                        # (2 unchanged elements hidden)
                    },
                  + {
                      + Action   = [
                          + "logs:TestMetricFilter",
                          + "logs:StopQuery",
                          + "logs:StartQuery",
                          + "logs:List*",
                          + "logs:Get*",
                          + "logs:FilterLogEvents",
                          + "logs:Describe*",
                          + "cloudwatch:List*",
                          + "cloudwatch:Get*",
                          + "cloudwatch:Describe*",
                          + "autoscaling:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchReadOnlyAccess (partial)"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:Describe*",
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AmazonEC2ReadOnlyAccess (partial)"
                    },
                  + {
                      + Action   = [
                          + "ecr:List*",
                          + "ecr:Get*",
                          + "ecr:Describe*",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AmazonEC2ContainerRegistryReadOnly (modified)"
                    },
                  + {
                      + Action   = [
                          + "ecs:List*",
                          + "ecs:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.memo_board_tf_exec will be created
  + resource "aws_iam_policy" "memo_board_tf_exec" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "memo_board_tf_exec"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "IAMFullAccess"
                    },
                  + {
                      + Action   = [
                          + "logs:*",
                          + "elasticloadbalancing:*",
                          + "ecs:*",
                          + "ecr:*",
                          + "ec2:*",
                          + "cloudwatch:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.memo_board_tf_exec will be created
  + resource "aws_iam_role_policy_attachment" "memo_board_tf_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "memo-board-tf"
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":16,"Program":"tfcmt","SHA1":"f0f8635871ca962f71f848ef0b60c97b8869766a","Vars":{},"WorkflowName":"Terraform"} -->